$(function(){
	// Основной слайдер на главной
	$('.main_slider .slider').owlCarousel({
		items: 1,
		margin: 0,
		nav: true,
		dots: false,
		navText: [
			'<svg width="21" height="16" viewBox="0 0 21 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M7.91702 0.200195C7.61269 0.200195 7.30803 0.312201 7.07611 0.532446L0.34878 6.90462C-0.11626 7.34511 -0.11626 8.05829 0.34878 8.49766L7.07611 14.8698C7.54115 15.3103 8.29409 15.3103 8.75794 14.8698L8.86015 14.773C9.32519 14.3325 9.32519 13.6193 8.86015 13.18L4.26531 8.82771H19.8106C20.4672 8.82771 21 8.323 21 7.70114C21 7.07927 20.4672 6.57457 19.8106 6.57457H4.26531L8.86015 2.2223C9.32519 1.78181 9.32519 1.06862 8.86015 0.629261L8.75794 0.532446C8.52542 0.312201 8.22135 0.200195 7.91702 0.200195Z" fill="white"/></svg>',
	        '<svg width="21" height="16" viewBox="0 0 21 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M13.083 0.200195C13.3873 0.200195 13.692 0.312201 13.9239 0.532446L20.6512 6.90462C21.1163 7.34511 21.1163 8.05829 20.6512 8.49766L13.9239 14.8698C13.4589 15.3103 12.7059 15.3103 12.2421 14.8698L12.1399 14.773C11.6748 14.3325 11.6748 13.6193 12.1399 13.18L16.7347 8.82771H1.18936C0.532833 8.82771 0 8.323 0 7.70114C0 7.07927 0.532833 6.57457 1.18936 6.57457H16.7347L12.1399 2.2223C11.6748 1.78181 11.6748 1.06862 12.1399 0.629261L12.2421 0.532446C12.4746 0.312201 12.7786 0.200195 13.083 0.200195Z" fill="white"/></svg>'
	        
	    ],
		loop: true,
		smartSpeed: 750,
		autoplay: true,
		autoplayTimeout: 5000,
		
	})


	// Основной слайдер на главной
	 var owl = $('.main_slider2 .slider').owlCarousel({
		items: 1,
		margin: 0,
		nav: true,
		dots: false,
	navText: [
			'<svg width="21" height="16" viewBox="0 0 21 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M7.91702 0.200195C7.61269 0.200195 7.30803 0.312201 7.07611 0.532446L0.34878 6.90462C-0.11626 7.34511 -0.11626 8.05829 0.34878 8.49766L7.07611 14.8698C7.54115 15.3103 8.29409 15.3103 8.75794 14.8698L8.86015 14.773C9.32519 14.3325 9.32519 13.6193 8.86015 13.18L4.26531 8.82771H19.8106C20.4672 8.82771 21 8.323 21 7.70114C21 7.07927 20.4672 6.57457 19.8106 6.57457H4.26531L8.86015 2.2223C9.32519 1.78181 9.32519 1.06862 8.86015 0.629261L8.75794 0.532446C8.52542 0.312201 8.22135 0.200195 7.91702 0.200195Z" fill="white"/></svg>',
	        '<svg width="21" height="16" viewBox="0 0 21 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M13.083 0.200195C13.3873 0.200195 13.692 0.312201 13.9239 0.532446L20.6512 6.90462C21.1163 7.34511 21.1163 8.05829 20.6512 8.49766L13.9239 14.8698C13.4589 15.3103 12.7059 15.3103 12.2421 14.8698L12.1399 14.773C11.6748 14.3325 11.6748 13.6193 12.1399 13.18L16.7347 8.82771H1.18936C0.532833 8.82771 0 8.323 0 7.70114C0 7.07927 0.532833 6.57457 1.18936 6.57457H16.7347L12.1399 2.2223C11.6748 1.78181 11.6748 1.06862 12.1399 0.629261L12.2421 0.532446C12.4746 0.312201 12.7786 0.200195 13.083 0.200195Z" fill="white"/></svg>'
	        
	    ],
		loop: true,
		smartSpeed: 750,
		autoplay: true,
		autoplayTimeout: 5000,
		onInitialized: function(event){
			setTimeout(function(){
				let dotsOffset = $(event.target).find('.owl-next').offset()

				$(event.target).find('.owl-nav button.owl-prev').css(
					'left', (dotsOffset.left - 10)
				)
			}, 100)
		},
		onResized: function(event){
			setTimeout(function(){
				let dotsOffset = $(event.target).find('.owl-next').offset()

				$(event.target).find('.owl-nav button.owl-prev').css(
					'left', (dotsOffset.left - 10)
				)
			}, 100)
		}
	})


	// Основной слайдер на главной
	var owl2 =$('.main_slider3 .slider').owlCarousel({
		items: 1,
		margin: 0,
		nav: false,
		dots: false,		
		loop: true,
	navText: [
			'<svg width="21" height="16" viewBox="0 0 21 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M7.91702 0.200195C7.61269 0.200195 7.30803 0.312201 7.07611 0.532446L0.34878 6.90462C-0.11626 7.34511 -0.11626 8.05829 0.34878 8.49766L7.07611 14.8698C7.54115 15.3103 8.29409 15.3103 8.75794 14.8698L8.86015 14.773C9.32519 14.3325 9.32519 13.6193 8.86015 13.18L4.26531 8.82771H19.8106C20.4672 8.82771 21 8.323 21 7.70114C21 7.07927 20.4672 6.57457 19.8106 6.57457H4.26531L8.86015 2.2223C9.32519 1.78181 9.32519 1.06862 8.86015 0.629261L8.75794 0.532446C8.52542 0.312201 8.22135 0.200195 7.91702 0.200195Z" fill="white"/></svg>',
	        '<svg width="21" height="16" viewBox="0 0 21 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M13.083 0.200195C13.3873 0.200195 13.692 0.312201 13.9239 0.532446L20.6512 6.90462C21.1163 7.34511 21.1163 8.05829 20.6512 8.49766L13.9239 14.8698C13.4589 15.3103 12.7059 15.3103 12.2421 14.8698L12.1399 14.773C11.6748 14.3325 11.6748 13.6193 12.1399 13.18L16.7347 8.82771H1.18936C0.532833 8.82771 0 8.323 0 7.70114C0 7.07927 0.532833 6.57457 1.18936 6.57457H16.7347L12.1399 2.2223C11.6748 1.78181 11.6748 1.06862 12.1399 0.629261L12.2421 0.532446C12.4746 0.312201 12.7786 0.200195 13.083 0.200195Z" fill="white"/></svg>'
	        
	    ],
		smartSpeed: 750,
		autoplay: true,
		autoplayTimeout: 5000,		
	})

	 // Custom Button
	$('.customNextBtn').click(function() {
	    owl2.trigger('next.owl.carousel');
	});
	$('.customPreviousBtn').click(function() {
	    owl2.trigger('prev.owl.carousel');
	});


	// Отзывы
	$('.reviews .slider').owlCarousel({
		items: 2,
		margin: 73,
		nav: true,
	navText: [
			'<svg width="21" height="16" viewBox="0 0 21 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M7.91702 0.200195C7.61269 0.200195 7.30803 0.312201 7.07611 0.532446L0.34878 6.90462C-0.11626 7.34511 -0.11626 8.05829 0.34878 8.49766L7.07611 14.8698C7.54115 15.3103 8.29409 15.3103 8.75794 14.8698L8.86015 14.773C9.32519 14.3325 9.32519 13.6193 8.86015 13.18L4.26531 8.82771H19.8106C20.4672 8.82771 21 8.323 21 7.70114C21 7.07927 20.4672 6.57457 19.8106 6.57457H4.26531L8.86015 2.2223C9.32519 1.78181 9.32519 1.06862 8.86015 0.629261L8.75794 0.532446C8.52542 0.312201 8.22135 0.200195 7.91702 0.200195Z" fill="white"/></svg>',
	        '<svg width="21" height="16" viewBox="0 0 21 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M13.083 0.200195C13.3873 0.200195 13.692 0.312201 13.9239 0.532446L20.6512 6.90462C21.1163 7.34511 21.1163 8.05829 20.6512 8.49766L13.9239 14.8698C13.4589 15.3103 12.7059 15.3103 12.2421 14.8698L12.1399 14.773C11.6748 14.3325 11.6748 13.6193 12.1399 13.18L16.7347 8.82771H1.18936C0.532833 8.82771 0 8.323 0 7.70114C0 7.07927 0.532833 6.57457 1.18936 6.57457H16.7347L12.1399 2.2223C11.6748 1.78181 11.6748 1.06862 12.1399 0.629261L12.2421 0.532446C12.4746 0.312201 12.7786 0.200195 13.083 0.200195Z" fill="white"/></svg>'
	        
	    ],
		dotsEach : true,
		dots: false,
		loop: false,
		smartSpeed: 750,
		responsive: {
	        0:{
	            items: 1,
	            margin: 20
	        },
	        768:{
	            items: 2,
	            margin: 36
	        },
	        1024:{
	            items: 3,
	            margin: 36
	        },
	        1200:{
	            items: 3,
	            margin: 36
	        }
		}		
	})


	// Статьи
	$('.articles .slider').owlCarousel({
		items: 1,
		nav: true,
		dots: false,
	navText: [
			'<svg width="21" height="16" viewBox="0 0 21 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M7.91702 0.200195C7.61269 0.200195 7.30803 0.312201 7.07611 0.532446L0.34878 6.90462C-0.11626 7.34511 -0.11626 8.05829 0.34878 8.49766L7.07611 14.8698C7.54115 15.3103 8.29409 15.3103 8.75794 14.8698L8.86015 14.773C9.32519 14.3325 9.32519 13.6193 8.86015 13.18L4.26531 8.82771H19.8106C20.4672 8.82771 21 8.323 21 7.70114C21 7.07927 20.4672 6.57457 19.8106 6.57457H4.26531L8.86015 2.2223C9.32519 1.78181 9.32519 1.06862 8.86015 0.629261L8.75794 0.532446C8.52542 0.312201 8.22135 0.200195 7.91702 0.200195Z" fill="white"/></svg>',
	        '<svg width="21" height="16" viewBox="0 0 21 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M13.083 0.200195C13.3873 0.200195 13.692 0.312201 13.9239 0.532446L20.6512 6.90462C21.1163 7.34511 21.1163 8.05829 20.6512 8.49766L13.9239 14.8698C13.4589 15.3103 12.7059 15.3103 12.2421 14.8698L12.1399 14.773C11.6748 14.3325 11.6748 13.6193 12.1399 13.18L16.7347 8.82771H1.18936C0.532833 8.82771 0 8.323 0 7.70114C0 7.07927 0.532833 6.57457 1.18936 6.57457H16.7347L12.1399 2.2223C11.6748 1.78181 11.6748 1.06862 12.1399 0.629261L12.2421 0.532446C12.4746 0.312201 12.7786 0.200195 13.083 0.200195Z" fill="white"/></svg>'
	        
	    ],
		dotsEach : false,
		loop: false,
		smartSpeed: 750,
		responsive: {
	        0:{
	            items: 1,
	            margin: 20
	        },
	        768:{
	            items: 2,
	            margin: 36
	        },
	        1024:{
	            items: 3,
	            margin: 36
	        },
	        1200:{
	            items: 3,
	            margin: 36
	        }
		}
	})


	// Видео отзывы
	$('.video_reviews .slider').owlCarousel({
		items: 1,
		nav: true,
		dots: false,
		loop: false,
	navText: [
			'<svg width="21" height="16" viewBox="0 0 21 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M7.91702 0.200195C7.61269 0.200195 7.30803 0.312201 7.07611 0.532446L0.34878 6.90462C-0.11626 7.34511 -0.11626 8.05829 0.34878 8.49766L7.07611 14.8698C7.54115 15.3103 8.29409 15.3103 8.75794 14.8698L8.86015 14.773C9.32519 14.3325 9.32519 13.6193 8.86015 13.18L4.26531 8.82771H19.8106C20.4672 8.82771 21 8.323 21 7.70114C21 7.07927 20.4672 6.57457 19.8106 6.57457H4.26531L8.86015 2.2223C9.32519 1.78181 9.32519 1.06862 8.86015 0.629261L8.75794 0.532446C8.52542 0.312201 8.22135 0.200195 7.91702 0.200195Z" fill="white"/></svg>',
	        '<svg width="21" height="16" viewBox="0 0 21 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M13.083 0.200195C13.3873 0.200195 13.692 0.312201 13.9239 0.532446L20.6512 6.90462C21.1163 7.34511 21.1163 8.05829 20.6512 8.49766L13.9239 14.8698C13.4589 15.3103 12.7059 15.3103 12.2421 14.8698L12.1399 14.773C11.6748 14.3325 11.6748 13.6193 12.1399 13.18L16.7347 8.82771H1.18936C0.532833 8.82771 0 8.323 0 7.70114C0 7.07927 0.532833 6.57457 1.18936 6.57457H16.7347L12.1399 2.2223C11.6748 1.78181 11.6748 1.06862 12.1399 0.629261L12.2421 0.532446C12.4746 0.312201 12.7786 0.200195 13.083 0.200195Z" fill="white"/></svg>'
	        
	    ],
		smartSpeed: 750,
		responsive: {
	        0:{
	            items: 1,
	            margin: 20
	        },
	        768:{
	            items: 2,
	            margin: 36
	        },
	        1024:{
	            items: 3,
	            margin: 36
	        },
	        1200:{
	            items: 3,
	            margin: 36
	        }
		},		
	})


	// Акции
	$('.stocks .slider').owlCarousel({
		items: 1,
		nav: true,
		dots: false,
	navText: [
			'<svg width="21" height="16" viewBox="0 0 21 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M7.91702 0.200195C7.61269 0.200195 7.30803 0.312201 7.07611 0.532446L0.34878 6.90462C-0.11626 7.34511 -0.11626 8.05829 0.34878 8.49766L7.07611 14.8698C7.54115 15.3103 8.29409 15.3103 8.75794 14.8698L8.86015 14.773C9.32519 14.3325 9.32519 13.6193 8.86015 13.18L4.26531 8.82771H19.8106C20.4672 8.82771 21 8.323 21 7.70114C21 7.07927 20.4672 6.57457 19.8106 6.57457H4.26531L8.86015 2.2223C9.32519 1.78181 9.32519 1.06862 8.86015 0.629261L8.75794 0.532446C8.52542 0.312201 8.22135 0.200195 7.91702 0.200195Z" fill="white"/></svg>',
	        '<svg width="21" height="16" viewBox="0 0 21 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M13.083 0.200195C13.3873 0.200195 13.692 0.312201 13.9239 0.532446L20.6512 6.90462C21.1163 7.34511 21.1163 8.05829 20.6512 8.49766L13.9239 14.8698C13.4589 15.3103 12.7059 15.3103 12.2421 14.8698L12.1399 14.773C11.6748 14.3325 11.6748 13.6193 12.1399 13.18L16.7347 8.82771H1.18936C0.532833 8.82771 0 8.323 0 7.70114C0 7.07927 0.532833 6.57457 1.18936 6.57457H16.7347L12.1399 2.2223C11.6748 1.78181 11.6748 1.06862 12.1399 0.629261L12.2421 0.532446C12.4746 0.312201 12.7786 0.200195 13.083 0.200195Z" fill="white"/></svg>'
	        
	    ],
		dotsEach : true,
		loop: false,
		smartSpeed: 750,
		responsive: {
	        0:{
	            items: 1,
	            margin: 20
	        },
	        768:{
	            items: 2,
	            margin: 36
	        },
	        1024:{
	            items: 3,
	            margin: 36
	        },
	        1200:{
	            items: 3,
	            margin: 36
	        }
		},
		
	})


	// Сотрудники
	$('.team .slider').owlCarousel({
		items: 1,
		margin: 73,
		nav: true,
		dotsEach : true,
		dots: false,
		loop: false,
	navText: [
			'<svg width="21" height="16" viewBox="0 0 21 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M7.91702 0.200195C7.61269 0.200195 7.30803 0.312201 7.07611 0.532446L0.34878 6.90462C-0.11626 7.34511 -0.11626 8.05829 0.34878 8.49766L7.07611 14.8698C7.54115 15.3103 8.29409 15.3103 8.75794 14.8698L8.86015 14.773C9.32519 14.3325 9.32519 13.6193 8.86015 13.18L4.26531 8.82771H19.8106C20.4672 8.82771 21 8.323 21 7.70114C21 7.07927 20.4672 6.57457 19.8106 6.57457H4.26531L8.86015 2.2223C9.32519 1.78181 9.32519 1.06862 8.86015 0.629261L8.75794 0.532446C8.52542 0.312201 8.22135 0.200195 7.91702 0.200195Z" fill="white"/></svg>',
	        '<svg width="21" height="16" viewBox="0 0 21 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M13.083 0.200195C13.3873 0.200195 13.692 0.312201 13.9239 0.532446L20.6512 6.90462C21.1163 7.34511 21.1163 8.05829 20.6512 8.49766L13.9239 14.8698C13.4589 15.3103 12.7059 15.3103 12.2421 14.8698L12.1399 14.773C11.6748 14.3325 11.6748 13.6193 12.1399 13.18L16.7347 8.82771H1.18936C0.532833 8.82771 0 8.323 0 7.70114C0 7.07927 0.532833 6.57457 1.18936 6.57457H16.7347L12.1399 2.2223C11.6748 1.78181 11.6748 1.06862 12.1399 0.629261L12.2421 0.532446C12.4746 0.312201 12.7786 0.200195 13.083 0.200195Z" fill="white"/></svg>'
	        
	    ],
		smartSpeed: 750,
		responsive: {
	        0:{
	            items: 1,
	            margin: 20
	        },
	        768:{
	            items: 2,
	            margin: 36
	        },
	        1024:{
	            items: 2,
	            margin: 36
	        },
	        1200:{
	            items: 3,
	            margin: 36
	        }
		},
		
	})


	// Вакансии
	$('.vacancies .slider').owlCarousel({
		items: 1,
		nav: true,
		dots: false,
	navText: [
			'<svg width="21" height="16" viewBox="0 0 21 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M7.91702 0.200195C7.61269 0.200195 7.30803 0.312201 7.07611 0.532446L0.34878 6.90462C-0.11626 7.34511 -0.11626 8.05829 0.34878 8.49766L7.07611 14.8698C7.54115 15.3103 8.29409 15.3103 8.75794 14.8698L8.86015 14.773C9.32519 14.3325 9.32519 13.6193 8.86015 13.18L4.26531 8.82771H19.8106C20.4672 8.82771 21 8.323 21 7.70114C21 7.07927 20.4672 6.57457 19.8106 6.57457H4.26531L8.86015 2.2223C9.32519 1.78181 9.32519 1.06862 8.86015 0.629261L8.75794 0.532446C8.52542 0.312201 8.22135 0.200195 7.91702 0.200195Z" fill="white"/></svg>',
	        '<svg width="21" height="16" viewBox="0 0 21 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M13.083 0.200195C13.3873 0.200195 13.692 0.312201 13.9239 0.532446L20.6512 6.90462C21.1163 7.34511 21.1163 8.05829 20.6512 8.49766L13.9239 14.8698C13.4589 15.3103 12.7059 15.3103 12.2421 14.8698L12.1399 14.773C11.6748 14.3325 11.6748 13.6193 12.1399 13.18L16.7347 8.82771H1.18936C0.532833 8.82771 0 8.323 0 7.70114C0 7.07927 0.532833 6.57457 1.18936 6.57457H16.7347L12.1399 2.2223C11.6748 1.78181 11.6748 1.06862 12.1399 0.629261L12.2421 0.532446C12.4746 0.312201 12.7786 0.200195 13.083 0.200195Z" fill="white"/></svg>'
	        
	    ],
		dotsEach : true,
		loop: false,
		smartSpeed: 750,
		responsive: {
	        0:{
	            items: 1,
	            margin: 20
	        },
	         768:{
	            items: 2,
	            margin: 36
	        },
	        1024:{
	            items: 3,
	            margin: 36
	        },
	        1200:{
	            items: 3,
	            margin: 36
	        }
		},
		
	})


	// Меню в шапке
	$('header .menu').flexMenu({		
		showOnHover: true,
		linkText: '<span>ОСТАЛЬНОЕ</span>',
		linkTitle: '',
		linkTextAll: 'Меню',
	})

	//социальные сети
	if($('.mob_scroll .socials a').length>4)
	{
		$(".mob_scroll .socials a").eq(2).after($('<a href="/" class="more"><img src="./images/dot2.svg" alt=""><div class="arrow"><svg width="9" height="5" viewBox="0 0 9 5" fill="none" xmlns="http://www.w3.org/2000/svg"><path fill-rule="evenodd" clip-rule="evenodd" d="M4.5 5L0 0L9 0L4.5 5Z" fill=""/></svg></div><div class="more_block"></div></a>'));
		$('.mob_scroll .socials a').each(function( index, element ) {
			if(index>3)
			{
				$(element).clone(true).appendTo(".mob_scroll .more_block");
				(element).remove();
			}
		});
	}
	$('body').on('click', '.mob_scroll .more_block a', function(e) {
		var href = $(this).attr('href');
      	window.open(href, '_blank');
	});

	$('body').on('click', '.mob_scroll a.more', function(e) {
    	e.preventDefault()
    });


	if($('.mob_header .socials a').length>4)
	{
		$(".mob_header .socials a").eq(2).after($('<a href="/" class="more"><img src="./images/dot2.svg" alt=""><div class="arrow"><svg width="9" height="5" viewBox="0 0 9 5" fill="none" xmlns="http://www.w3.org/2000/svg"><path fill-rule="evenodd" clip-rule="evenodd" d="M4.5 5L0 0L9 0L4.5 5Z" fill=""/></svg></div><div class="more_block"></div></a>'));
		$('.mob_header .socials a').each(function( index, element ) {
			if(index>3)
			{
				$(element).clone(true).appendTo(".mob_header .more_block");
				(element).remove();
			}
		});
	}
	$('body').on('click', '.mob_header .more_block a', function(e) {
		var href = $(this).attr('href');
      	window.open(href, '_blank');
	});


	$('body').on('click', '.mob_header a.more', function(e) {
    	e.preventDefault()
    });


	if($('.mob_header .contacts a').length>2)
	{	
		$('.mob_header .contacts a').each(function( index, element ) {
			if(index>2)
			{
				$(element).clone(true).appendTo(".mob_header .more_block").addClass("new_contact");
				(element).remove();
			}
		});
	}


	// Фильтр
	$('body').on('click', 'aside .mob_filter_link', function(e) {
    	e.preventDefault()

    	if( $(this).hasClass('active') ) {
			$(this).removeClass('active')
			$('aside .filter').fadeOut(200)
			$('.overlay').fadeOut(200)
		} else {
			$(this).addClass('active')
			$('aside .filter').fadeIn(300)
			$('.overlay').fadeIn(300)
		}
	})

	$('aside .filter .close, .overlay, aside .block .title .close').click(function(e){
		e.preventDefault()
	    $('aside .mob_filter_link').removeClass('active')
		$('aside .filter').fadeOut(200)
		$('.overlay').fadeOut(200)
	})


	$priceRange = $('.filter #price_range').ionRangeSlider({
        type     : 'double',
        min      : 0,
        max      : 10000,
        from     : 1000,
        to       : 5000,
        step     : 10,
        postfix  : ' ₽'
    }).data("ionRangeSlider")


    // Таймер
	$('.timer').each(function(){
		let timerDate = $(this).data('date')


		$(this).countdown(timerDate, function(event) {
			let daysArr = event.strftime( '%D' ).split('')
			let hoursArr = event.strftime( '%H' ).split('')
			let minutesArr = event.strftime( '%M' ).split('')
			let secondsArr = event.strftime( '%S' ).split('')

			$(this).html( event.strftime(String()
				+ '<div class="item">'
					+ '<div class="val"><span>'+daysArr[0]+'</span><span>'+daysArr[1]+'</span></div>'
					+ '<div>дней</div>'
				+ '</div>'

				+ '<div class="item">'
					+ '<div class="val"><span>'+hoursArr[0]+'</span><span>'+hoursArr[1]+'</span></div>'
					+ '<div>часов</div>'
				+ '</div>'

				+ '<div class="item">'
					+ '<div class="val"><span>'+minutesArr[0]+'</span><span>'+minutesArr[1]+'</span></div>'
					+ '<div>минут</div>'
				+ '</div>'

				+ '<div class="item">'
					+ '<div class="val"><span>'+secondsArr[0]+'</span><span>'+secondsArr[1]+'</span></div>'
					+ '<div>секунд</div>'
				+ '</div>'
				) )
		})
	})


	// До/После
	$('.before_after .item').each(function(){
		$(this).beforeAfter()
	})


	// Фото с маркерами
	$('.image_tips .image .btn').click(function(e){
		e.preventDefault()

		let parent = $(this).closest('.image')
		let info = $(this).data('info')

		if( $(this).parents('.item').hasClass('active') ) {
			parent.find('.item').removeClass('active')
			parent.find('.info').hide()
		} else {
			parent.find('.item').removeClass('active')
			parent.find('.info').hide()

			$(this).parents('.item').addClass('active')
			parent.find(info).fadeIn(300)
		}
	})

	$('.image_tips .image .close').click(function(e){
		e.preventDefault()

		let parent = $(this).closest('.image')

		parent.find('.item').removeClass('active')
		parent.find('.info').hide()
	})


	// Квиз-Опрос
	$('.quiz_poll .step .links .next').click(function(e){
		e.preventDefault()

		let parent = $(this).closest('.steps')
		let nextStep = $(this).data('step')

		if($(this).hasClass("valide"))
		{
			let check = $(this).parent().prev().find("input");

			if(check.val()!="")
			{	
				check.removeClass("error");			
				parent.find('.step').hide()
				parent.find(nextStep).fadeIn(300)
			}
			else
			{
				check.addClass("error");
			}
		}
		else
		{
			parent.find('.step').hide()
			parent.find(nextStep).fadeIn(300)
		}
	})


	$("input[name='agree']").change(function () {
		if (this.checked) {
			$(this).closest("form").find("button").prop("disabled", false);
		}
		else
		{
			$(this).closest("form").find("button").prop("disabled", true);
		}
	});

	$('.product_delete').click(function(e){
		e.preventDefault();
		$(this).parent().parent().remove();
	});


	// Покупка товара
	$('.product_info .buy .buy_link').click(function(e){
		e.preventDefault()

		let parent = $(this).closest('.btn')

		$(this).addClass('bounceOut')
		parent.find('.order_link').delay(750).fadeIn(300)
	})

	// Социальная выпадашка
	$('header .socials a.more, .mob_header .socials a.more').click(function(e){
		e.preventDefault()
		if($(this).hasClass("active"))
		{
			$(this).removeClass("active")
		}
		else
		{
			$(this).addClass("active")
		}
		
	})

	$('.products_sort_mobile .schema-order__link').click(function(e){
		e.preventDefault()	
		if($(this).hasClass("active"))
		{
			$(this).removeClass("active");
			$(".schema-order__popover").hide();
		}	
		else
		{
			$(this).addClass("active");
			$(".schema-order__popover").show();
		}

	})


	// Логотип
	$('.resizeble-font').each(function () {
        let length = $(this).text().replace(/^\s+|\s+$|\(|\)|8-/gm, '').length,
            size = $(this).width() / length * parseFloat($(this).data('ratio'))

        if( size > 33 ) {
        	size = 33
        }

        if( size < 16 ) {
        	size = 16
        }
        size2 = size+4
        $(this).css('font-size', size + 'px').css('line-height', size2 + 'px')
    })

    $('.resizeble-font2').each(function () {
        let length = $(this).text().replace(/^\s+|\s+$|\(|\)|8-/gm, '').length,
            size = $(this).width() / length * parseFloat($(this).data('ratio'))

        if( size > 16 ) {
        	size = 16
        }

        if( size < 10 ) {
        	size = 10
        }

        $(this).css('font-size', size + 'px')
    })


    $('.resizeble-font3').each(function () {
        let length = $(this).text().replace(/^\s+|\s+$|\(|\)|8-/gm, '').length,
            size = $(this).width() / length * parseFloat($(this).data('ratio'))

        if( size > 48 ) {
        	size = 48
        }

        if( size < 14 ) {
        	size = 14
        }

        size2 = size+3

        $(this).css('font-size', size + 'px').css('line-height', size2 + 'px')
    })


    $('.apply').click(function(e){
		//e.preventDefault()
		let color1 =  $(".color1").val();
    	let color2 =  $(".color2").val();

		localStorage.setItem('color1', color1);
		localStorage.setItem('color2', color2);

		window.location.reload(true)
	});

	$('.clear').click(function(e){
		//e.preventDefault()
		localStorage.removeItem('color1');
		localStorage.removeItem('color2');
		window.location.reload(true)
	});

		

    let color1 = localStorage.getItem('color1');
    let color2 = localStorage.getItem('color2');

    if(color1!=null)
    {
	    $(".color1").val(color1);
	    $(".color2").val(color2);

	    var root = document.querySelector(':root');
	    root.style.setProperty('--main_color1', color1);
	    root.style.setProperty('--main_color2', color2);

	    let rgba = hexDec(color1);
	    
	    root.style.setProperty('--box-shadow-color', "rgba("+rgba+",0.35)");

	    let rgba_opacity = hexDec(color2);

	    root.style.setProperty('--main_color_opacity', "rgba("+rgba_opacity+",1)");	    
    }



	if($(window).width() < 480)
	{
	    var config = {
		    elements: {
				email:"hallo@f2.codes",
				phone: "+490000000000",
				whatsApp: "79120374755",	        
				viber: "79120374755",
				native: "123",
				facebook : "123",
				vk: "123",
				instagram: "123",
				od: "123",
		      },
		      position: {
				left: "10px",
				bottom: "10px"
		      }
	    };
	    buildContactButton(config);
	}



	/*SVG CHANGE*/

	var svg = '<svg width="401" height="533" viewBox="0 0 401 533" fill="none" xmlns="http://www.w3.org/2000/svg"><path  fill-rule="evenodd" clip-rule="evenodd" d="M5.17365 110.794C39.0314 -33.7922 378.639 -36.0159 397 100.005C415.361 236.026 350.954 533 247.612 533C144.27 533 -28.6841 255.38 5.17365 110.794Z" fill="'+color2+'"/></svg>';

	var encoded = window.btoa(svg);	
	document.styleSheets[0].addRule('.advantages .flex:after, .articles .cont:after, .reviews .slider_wrap:after, .services .flex:after, .video_reviews .cont:after, .prices .flex::after, .stocks .slider:after, .team .slider:after,.vacancies .slider:after',"background-image: url(data:image/svg+xml;base64,"+encoded+") !important;");


	var svg = '<svg width="227" height="323" viewBox="0 0 227 323" fill="none" xmlns="http://www.w3.org/2000/svg"><path fill-rule="evenodd" clip-rule="evenodd" d="M221.5 11C224.538 11 227 8.53757 227 5.5C227 2.46243 224.538 0 221.5 0C218.462 0 216 2.46243 216 5.5C216 8.53757 218.462 11 221.5 11ZM221.5 43C224.538 43 227 40.5376 227 37.5C227 34.4624 224.538 32 221.5 32C218.462 32 216 34.4624 216 37.5C216 40.5376 218.462 43 221.5 43ZM221.5 74C224.538 74 227 71.5376 227 68.5C227 65.4624 224.538 63 221.5 63C218.462 63 216 65.4624 216 68.5C216 71.5376 218.462 74 221.5 74ZM221.5 104C224.538 104 227 101.538 227 98.5C227 95.4624 224.538 93 221.5 93C218.462 93 216 95.4624 216 98.5C216 101.538 218.462 104 221.5 104ZM221.5 136C224.538 136 227 133.538 227 130.5C227 127.462 224.538 125 221.5 125C218.462 125 216 127.462 216 130.5C216 133.538 218.462 136 221.5 136ZM221.5 166C224.538 166 227 163.538 227 160.5C227 157.462 224.538 155 221.5 155C218.462 155 216 157.462 216 160.5C216 163.538 218.462 166 221.5 166ZM221.5 198C224.538 198 227 195.538 227 192.5C227 189.462 224.538 187 221.5 187C218.462 187 216 189.462 216 192.5C216 195.538 218.462 198 221.5 198ZM221.5 230C224.538 230 227 227.538 227 224.5C227 221.462 224.538 219 221.5 219C218.462 219 216 221.462 216 224.5C216 227.538 218.462 230 221.5 230ZM221.5 260C224.538 260 227 257.538 227 254.5C227 251.462 224.538 249 221.5 249C218.462 249 216 251.462 216 254.5C216 257.538 218.462 260 221.5 260ZM221.5 291C224.538 291 227 288.538 227 285.5C227 282.462 224.538 280 221.5 280C218.462 280 216 282.462 216 285.5C216 288.538 218.462 291 221.5 291ZM134 317.5C134 320.538 131.538 323 128.5 323C125.462 323 123 320.538 123 317.5C123 314.462 125.462 312 128.5 312C131.538 312 134 314.462 134 317.5ZM159.5 323C162.538 323 165 320.538 165 317.5C165 314.462 162.538 312 159.5 312C156.462 312 154 314.462 154 317.5C154 320.538 156.462 323 159.5 323ZM196 317.5C196 320.538 193.538 323 190.5 323C187.462 323 185 320.538 185 317.5C185 314.462 187.462 312 190.5 312C193.538 312 196 314.462 196 317.5ZM227 317.5C227 320.538 224.538 323 221.5 323C218.462 323 216 320.538 216 317.5C216 314.462 218.462 312 221.5 312C224.538 312 227 314.462 227 317.5ZM196 285.5C196 288.538 193.538 291 190.5 291C187.462 291 185 288.538 185 285.5C185 282.462 187.462 280 190.5 280C193.538 280 196 282.462 196 285.5ZM159.5 291C162.538 291 165 288.538 165 285.5C165 282.462 162.538 280 159.5 280C156.462 280 154 282.462 154 285.5C154 288.538 156.462 291 159.5 291ZM134 285.5C134 288.538 131.538 291 128.5 291C125.462 291 123 288.538 123 285.5C123 282.462 125.462 280 128.5 280C131.538 280 134 282.462 134 285.5ZM196 254.5C196 257.538 193.538 260 190.5 260C187.462 260 185 257.538 185 254.5C185 251.462 187.462 249 190.5 249C193.538 249 196 251.462 196 254.5ZM159.5 260C162.538 260 165 257.538 165 254.5C165 251.462 162.538 249 159.5 249C156.462 249 154 251.462 154 254.5C154 257.538 156.462 260 159.5 260ZM134 254.5C134 257.538 131.538 260 128.5 260C125.462 260 123 257.538 123 254.5C123 251.462 125.462 249 128.5 249C131.538 249 134 251.462 134 254.5ZM196 224.5C196 227.538 193.538 230 190.5 230C187.462 230 185 227.538 185 224.5C185 221.462 187.462 219 190.5 219C193.538 219 196 221.462 196 224.5ZM159.5 230C162.538 230 165 227.538 165 224.5C165 221.462 162.538 219 159.5 219C156.462 219 154 221.462 154 224.5C154 227.538 156.462 230 159.5 230ZM134 224.5C134 227.538 131.538 230 128.5 230C125.462 230 123 227.538 123 224.5C123 221.462 125.462 219 128.5 219C131.538 219 134 221.462 134 224.5ZM196 192.5C196 195.538 193.538 198 190.5 198C187.462 198 185 195.538 185 192.5C185 189.462 187.462 187 190.5 187C193.538 187 196 189.462 196 192.5ZM159.5 198C162.538 198 165 195.538 165 192.5C165 189.462 162.538 187 159.5 187C156.462 187 154 189.462 154 192.5C154 195.538 156.462 198 159.5 198ZM134 192.5C134 195.538 131.538 198 128.5 198C125.462 198 123 195.538 123 192.5C123 189.462 125.462 187 128.5 187C131.538 187 134 189.462 134 192.5ZM196 160.5C196 163.538 193.538 166 190.5 166C187.462 166 185 163.538 185 160.5C185 157.462 187.462 155 190.5 155C193.538 155 196 157.462 196 160.5ZM159.5 166C162.538 166 165 163.538 165 160.5C165 157.462 162.538 155 159.5 155C156.462 155 154 157.462 154 160.5C154 163.538 156.462 166 159.5 166ZM134 160.5C134 163.538 131.538 166 128.5 166C125.462 166 123 163.538 123 160.5C123 157.462 125.462 155 128.5 155C131.538 155 134 157.462 134 160.5ZM196 130.5C196 133.538 193.538 136 190.5 136C187.462 136 185 133.538 185 130.5C185 127.462 187.462 125 190.5 125C193.538 125 196 127.462 196 130.5ZM159.5 136C162.538 136 165 133.538 165 130.5C165 127.462 162.538 125 159.5 125C156.462 125 154 127.462 154 130.5C154 133.538 156.462 136 159.5 136ZM134 130.5C134 133.538 131.538 136 128.5 136C125.462 136 123 133.538 123 130.5C123 127.462 125.462 125 128.5 125C131.538 125 134 127.462 134 130.5ZM196 98.5C196 101.538 193.538 104 190.5 104C187.462 104 185 101.538 185 98.5C185 95.4624 187.462 93 190.5 93C193.538 93 196 95.4624 196 98.5ZM159.5 104C162.538 104 165 101.538 165 98.5C165 95.4624 162.538 93 159.5 93C156.462 93 154 95.4624 154 98.5C154 101.538 156.462 104 159.5 104ZM134 98.5C134 101.538 131.538 104 128.5 104C125.462 104 123 101.538 123 98.5C123 95.4624 125.462 93 128.5 93C131.538 93 134 95.4624 134 98.5ZM196 68.5C196 71.5376 193.538 74 190.5 74C187.462 74 185 71.5376 185 68.5C185 65.4624 187.462 63 190.5 63C193.538 63 196 65.4624 196 68.5ZM159.5 74C162.538 74 165 71.5376 165 68.5C165 65.4624 162.538 63 159.5 63C156.462 63 154 65.4624 154 68.5C154 71.5376 156.462 74 159.5 74ZM134 68.5C134 71.5376 131.538 74 128.5 74C125.462 74 123 71.5376 123 68.5C123 65.4624 125.462 63 128.5 63C131.538 63 134 65.4624 134 68.5ZM196 37.5C196 40.5376 193.538 43 190.5 43C187.462 43 185 40.5376 185 37.5C185 34.4624 187.462 32 190.5 32C193.538 32 196 34.4624 196 37.5ZM159.5 43C162.538 43 165 40.5376 165 37.5C165 34.4624 162.538 32 159.5 32C156.462 32 154 34.4624 154 37.5C154 40.5376 156.462 43 159.5 43ZM134 37.5C134 40.5376 131.538 43 128.5 43C125.462 43 123 40.5376 123 37.5C123 34.4624 125.462 32 128.5 32C131.538 32 134 34.4624 134 37.5ZM196 5.5C196 8.53757 193.538 11 190.5 11C187.462 11 185 8.53757 185 5.5C185 2.46243 187.462 0 190.5 0C193.538 0 196 2.46243 196 5.5ZM159.5 11C162.538 11 165 8.53757 165 5.5C165 2.46243 162.538 0 159.5 0C156.462 0 154 2.46243 154 5.5C154 8.53757 156.462 11 159.5 11ZM134 5.5C134 8.53757 131.538 11 128.5 11C125.462 11 123 8.53757 123 5.5C123 2.46243 125.462 0 128.5 0C131.538 0 134 2.46243 134 5.5ZM98.5 323C101.538 323 104 320.538 104 317.5C104 314.462 101.538 312 98.5 312C95.4624 312 93 314.462 93 317.5C93 320.538 95.4624 323 98.5 323ZM73 317.5C73 320.538 70.5376 323 67.5 323C64.4624 323 62 320.538 62 317.5C62 314.462 64.4624 312 67.5 312C70.5376 312 73 314.462 73 317.5ZM36.5 323C39.5376 323 42 320.538 42 317.5C42 314.462 39.5376 312 36.5 312C33.4624 312 31 314.462 31 317.5C31 320.538 33.4624 323 36.5 323ZM11 317.5C11 320.538 8.53757 323 5.5 323C2.46243 323 0 320.538 0 317.5C0 314.462 2.46243 312 5.5 312C8.53757 312 11 314.462 11 317.5ZM98.5 291C101.538 291 104 288.538 104 285.5C104 282.462 101.538 280 98.5 280C95.4624 280 93 282.462 93 285.5C93 288.538 95.4624 291 98.5 291ZM73 285.5C73 288.538 70.5376 291 67.5 291C64.4624 291 62 288.538 62 285.5C62 282.462 64.4624 280 67.5 280C70.5376 280 73 282.462 73 285.5ZM36.5 291C39.5376 291 42 288.538 42 285.5C42 282.462 39.5376 280 36.5 280C33.4624 280 31 282.462 31 285.5C31 288.538 33.4624 291 36.5 291ZM11 285.5C11 288.538 8.53757 291 5.5 291C2.46243 291 0 288.538 0 285.5C0 282.462 2.46243 280 5.5 280C8.53757 280 11 282.462 11 285.5ZM98.5 260C101.538 260 104 257.538 104 254.5C104 251.462 101.538 249 98.5 249C95.4624 249 93 251.462 93 254.5C93 257.538 95.4624 260 98.5 260ZM73 254.5C73 257.538 70.5376 260 67.5 260C64.4624 260 62 257.538 62 254.5C62 251.462 64.4624 249 67.5 249C70.5376 249 73 251.462 73 254.5ZM36.5 260C39.5376 260 42 257.538 42 254.5C42 251.462 39.5376 249 36.5 249C33.4624 249 31 251.462 31 254.5C31 257.538 33.4624 260 36.5 260ZM11 254.5C11 257.538 8.53757 260 5.5 260C2.46243 260 0 257.538 0 254.5C0 251.462 2.46243 249 5.5 249C8.53757 249 11 251.462 11 254.5ZM98.5 230C101.538 230 104 227.538 104 224.5C104 221.462 101.538 219 98.5 219C95.4624 219 93 221.462 93 224.5C93 227.538 95.4624 230 98.5 230ZM73 224.5C73 227.538 70.5376 230 67.5 230C64.4624 230 62 227.538 62 224.5C62 221.462 64.4624 219 67.5 219C70.5376 219 73 221.462 73 224.5ZM36.5 230C39.5376 230 42 227.538 42 224.5C42 221.462 39.5376 219 36.5 219C33.4624 219 31 221.462 31 224.5C31 227.538 33.4624 230 36.5 230ZM11 224.5C11 227.538 8.53757 230 5.5 230C2.46243 230 0 227.538 0 224.5C0 221.462 2.46243 219 5.5 219C8.53757 219 11 221.462 11 224.5ZM98.5 198C101.538 198 104 195.538 104 192.5C104 189.462 101.538 187 98.5 187C95.4624 187 93 189.462 93 192.5C93 195.538 95.4624 198 98.5 198ZM73 192.5C73 195.538 70.5376 198 67.5 198C64.4624 198 62 195.538 62 192.5C62 189.462 64.4624 187 67.5 187C70.5376 187 73 189.462 73 192.5ZM36.5 198C39.5376 198 42 195.538 42 192.5C42 189.462 39.5376 187 36.5 187C33.4624 187 31 189.462 31 192.5C31 195.538 33.4624 198 36.5 198ZM11 192.5C11 195.538 8.53757 198 5.5 198C2.46243 198 0 195.538 0 192.5C0 189.462 2.46243 187 5.5 187C8.53757 187 11 189.462 11 192.5ZM98.5 166C101.538 166 104 163.538 104 160.5C104 157.462 101.538 155 98.5 155C95.4624 155 93 157.462 93 160.5C93 163.538 95.4624 166 98.5 166ZM73 160.5C73 163.538 70.5376 166 67.5 166C64.4624 166 62 163.538 62 160.5C62 157.462 64.4624 155 67.5 155C70.5376 155 73 157.462 73 160.5ZM36.5 166C39.5376 166 42 163.538 42 160.5C42 157.462 39.5376 155 36.5 155C33.4624 155 31 157.462 31 160.5C31 163.538 33.4624 166 36.5 166ZM11 160.5C11 163.538 8.53757 166 5.5 166C2.46243 166 0 163.538 0 160.5C0 157.462 2.46243 155 5.5 155C8.53757 155 11 157.462 11 160.5ZM98.5 136C101.538 136 104 133.538 104 130.5C104 127.462 101.538 125 98.5 125C95.4624 125 93 127.462 93 130.5C93 133.538 95.4624 136 98.5 136ZM73 130.5C73 133.538 70.5376 136 67.5 136C64.4624 136 62 133.538 62 130.5C62 127.462 64.4624 125 67.5 125C70.5376 125 73 127.462 73 130.5ZM36.5 136C39.5376 136 42 133.538 42 130.5C42 127.462 39.5376 125 36.5 125C33.4624 125 31 127.462 31 130.5C31 133.538 33.4624 136 36.5 136ZM11 130.5C11 133.538 8.53757 136 5.5 136C2.46243 136 0 133.538 0 130.5C0 127.462 2.46243 125 5.5 125C8.53757 125 11 127.462 11 130.5ZM98.5 104C101.538 104 104 101.538 104 98.5C104 95.4624 101.538 93 98.5 93C95.4624 93 93 95.4624 93 98.5C93 101.538 95.4624 104 98.5 104ZM73 98.5C73 101.538 70.5376 104 67.5 104C64.4624 104 62 101.538 62 98.5C62 95.4624 64.4624 93 67.5 93C70.5376 93 73 95.4624 73 98.5ZM36.5 104C39.5376 104 42 101.538 42 98.5C42 95.4624 39.5376 93 36.5 93C33.4624 93 31 95.4624 31 98.5C31 101.538 33.4624 104 36.5 104ZM11 98.5C11 101.538 8.53757 104 5.5 104C2.46243 104 0 101.538 0 98.5C0 95.4624 2.46243 93 5.5 93C8.53757 93 11 95.4624 11 98.5ZM98.5 74C101.538 74 104 71.5376 104 68.5C104 65.4624 101.538 63 98.5 63C95.4624 63 93 65.4624 93 68.5C93 71.5376 95.4624 74 98.5 74ZM73 68.5C73 71.5376 70.5376 74 67.5 74C64.4624 74 62 71.5376 62 68.5C62 65.4624 64.4624 63 67.5 63C70.5376 63 73 65.4624 73 68.5ZM36.5 74C39.5376 74 42 71.5376 42 68.5C42 65.4624 39.5376 63 36.5 63C33.4624 63 31 65.4624 31 68.5C31 71.5376 33.4624 74 36.5 74ZM11 68.5C11 71.5376 8.53757 74 5.5 74C2.46243 74 0 71.5376 0 68.5C0 65.4624 2.46243 63 5.5 63C8.53757 63 11 65.4624 11 68.5ZM98.5 43C101.538 43 104 40.5376 104 37.5C104 34.4624 101.538 32 98.5 32C95.4624 32 93 34.4624 93 37.5C93 40.5376 95.4624 43 98.5 43ZM73 37.5C73 40.5376 70.5376 43 67.5 43C64.4624 43 62 40.5376 62 37.5C62 34.4624 64.4624 32 67.5 32C70.5376 32 73 34.4624 73 37.5ZM36.5 43C39.5376 43 42 40.5376 42 37.5C42 34.4624 39.5376 32 36.5 32C33.4624 32 31 34.4624 31 37.5C31 40.5376 33.4624 43 36.5 43ZM11 37.5C11 40.5376 8.53757 43 5.5 43C2.46243 43 0 40.5376 0 37.5C0 34.4624 2.46243 32 5.5 32C8.53757 32 11 34.4624 11 37.5ZM98.5 11C101.538 11 104 8.53757 104 5.5C104 2.46243 101.538 0 98.5 0C95.4624 0 93 2.46243 93 5.5C93 8.53757 95.4624 11 98.5 11ZM73 5.5C73 8.53757 70.5376 11 67.5 11C64.4624 11 62 8.53757 62 5.5C62 2.46243 64.4624 0 67.5 0C70.5376 0 73 2.46243 73 5.5ZM36.5 11C39.5376 11 42 8.53757 42 5.5C42 2.46243 39.5376 0 36.5 0C33.4624 0 31 2.46243 31 5.5C31 8.53757 33.4624 11 36.5 11ZM11 5.5C11 8.53757 8.53757 11 5.5 11C2.46243 11 0 8.53757 0 5.5C0 2.46243 2.46243 0 5.5 0C8.53757 0 11 2.46243 11 5.5Z" fill="'+color2+'"/></svg>';

	var encoded = window.btoa(svg);	
	document.styleSheets[0].addRule('.first_section .cont:after',"background-image: url(data:image/svg+xml;base64,"+encoded+") !important;");

	/*var svg = '<svg width="1436" height="227" viewBox="0 0 1436 227" fill="none" xmlns="http://www.w3.org/2000/svg"><path opacity="0.346308" fill-rule="evenodd" clip-rule="evenodd" d="M713.339 226.999C417.57 227.324 121.084 87.1585 8.69902 27.7328C-4.74331 20.6249 0.415885 1.56702 15.6217 1.55033L1420.3 0.00887955C1435.55 -0.0078495 1440.72 19.1058 1427.22 26.1958C1313.61 85.8808 1013.83 226.67 713.339 226.999Z" fill="url(#paint0_linear)"/><defs><linearGradient id="paint0_linear" x1="1447.71" y1="226.235" x2="1447.47" y2="-0.775067" gradientUnits="userSpaceOnUse"><stop stop-color="'+color2+'" stop-opacity="0.303813"/><stop offset="1" stop-color="'+color2+'" stop-opacity="0.01"/></linearGradient></defs></svg>';

	var encoded = window.btoa(svg);	
	document.styleSheets[0].addRule('.block.bg',"background-image: url(data:image/svg+xml;base64,"+encoded+") !important;");*/

	

})

function hexDec(h){
	var m=h.slice(1).match(/.{2}/g);
	 
	m[0]=parseInt(m[0], 16);
	m[1]=parseInt(m[1], 16);
	m[2]=parseInt(m[2], 16);
	 
	return(m.join(','));
 };

 

function buildContactButton(config){
	var idNames = [
	 "firstButton", 
	 "secondButton", 
	 "thirdButton",
	 "fourthButton", 
	 "fifthButton", 
	 "sixthButton", 
	 "seventhButton",
	 "seventhButton2",
	 "seventhButton3",
	 "seventhButton4",
	 "seventhButton5" 
	];
	var idNamesPointer = 0;
	var button = "";

	button = '<div id="contactButton" style="bottom:'+config.position["bottom"]+'; left:'+config.position["left"]+'">';
	if(Object.keys(config.elements).length > 1) {
	button += '<a id="shadow-element" class="contact-button shadow"></a>';
	    button += '<a onclick="toggleUp(this)" style="background-color: #ee3b24" id="'+idNames[idNamesPointer]+'" class="main-button contact-button" role="button"><svg aria-hidden="true" focusable="false" data-prefix="far" data-icon="comments" class="svg-inline--fa fa-comments fa-w-18" role="img" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 576 512"><path fill="currentColor" d="M532 386.2c27.5-27.1 44-61.1 44-98.2 0-80-76.5-146.1-176.2-157.9C368.3 72.5 294.3 32 208 32 93.1 32 0 103.6 0 192c0 37 16.5 71 44 98.2-15.3 30.7-37.3 54.5-37.7 54.9-6.3 6.7-8.1 16.5-4.4 25 3.6 8.5 12 14 21.2 14 53.5 0 96.7-20.2 125.2-38.8 9.2 2.1 18.7 3.7 28.4 4.9C208.1 407.6 281.8 448 368 448c20.8 0 40.8-2.4 59.8-6.8C456.3 459.7 499.4 480 553 480c9.2 0 17.5-5.5 21.2-14 3.6-8.5 1.9-18.3-4.4-25-.4-.3-22.5-24.1-37.8-54.8zm-392.8-92.3L122.1 305c-14.1 9.1-28.5 16.3-43.1 21.4 2.7-4.7 5.4-9.7 8-14.8l15.5-31.1L77.7 256C64.2 242.6 48 220.7 48 192c0-60.7 73.3-112 160-112s160 51.3 160 112-73.3 112-160 112c-16.5 0-33-1.9-49-5.6l-19.8-4.5zM498.3 352l-24.7 24.4 15.5 31.1c2.6 5.1 5.3 10.1 8 14.8-14.6-5.1-29-12.3-43.1-21.4l-17.1-11.1-19.9 4.6c-16 3.7-32.5 5.6-49 5.6-54 0-102.2-20.1-131.3-49.7C338 339.5 416 272.9 416 192c0-3.4-.4-6.7-.7-10C479.7 196.5 528 238.8 528 288c0 28.7-16.2 50.6-29.7 64z"></path></svg></a>';
	    idNamesPointer++;
	}



	if(config.elements["email"]) {
	    button += '<a href="mailto:'+config.elements["email"]+'" style="background-color: #EF771E;" id="'+idNames[idNamesPointer]+'" class="shadow contact-button" role="button"><svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg"><path fill-rule="evenodd" clip-rule="evenodd" d="M5.3082 5.74463H24.5082C25.8282 5.74463 26.9082 6.8415 26.9082 8.18213V22.8071C26.9082 24.1478 25.8282 25.2446 24.5082 25.2446H5.3082C3.9882 25.2446 2.9082 24.1478 2.9082 22.8071V8.18213C2.9082 6.8415 3.9882 5.74463 5.3082 5.74463ZM16.1802 15.909L24.0282 10.9243C24.3282 10.7293 24.5082 10.4003 24.5082 10.0468C24.5082 9.23025 23.6322 8.74275 22.9482 9.16932L14.9082 14.2759L6.8682 9.16932C6.1842 8.74275 5.3082 9.23025 5.3082 10.0468C5.3082 10.4003 5.4882 10.7293 5.7882 10.9243L13.6362 15.909C14.4162 16.4087 15.4002 16.4087 16.1802 15.909Z" fill="white"/></svg></a>';
	    idNamesPointer++;
	}

	if(config.elements["phone"]) {
	    button += '<a href="tel:'+config.elements["phone"]+'" style="background-color: #888;" id="'+idNames[idNamesPointer]+'" class="shadow contact-button" role="button"><svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M11.8288 8.97746L10.0318 8.77229C9.60021 8.72276 9.17571 8.87134 8.87149 9.17556L7.56969 10.4774C5.56747 9.45857 3.92607 7.82423 2.90727 5.81492L4.21614 4.50604C4.52037 4.20182 4.66894 3.77731 4.61942 3.34574L4.41424 1.56283C4.32934 0.848249 3.72797 0.310547 3.00632 0.310547H1.78234C0.98287 0.310547 0.31782 0.9756 0.367345 1.77508C0.74232 7.81716 5.57454 12.6423 11.6095 13.0173C12.409 13.0668 13.074 12.4018 13.074 11.6023V10.3783C13.0811 9.66374 12.5434 9.06236 11.8288 8.97746Z" fill="white"/></svg></a>';
	    idNamesPointer++;
	}

	if(config.elements["whatsApp"]) {
	    button += '<a target="blank" href="'+config.elements["whatsApp"]+'" style="background-color: #27D045 !important;" id="'+idNames[idNamesPointer]+'" class="shadow contact-button" role="button"><svg width="17" height="18" viewBox="0 0 17 18" fill="none" xmlns="http://www.w3.org/2000/svg"><path fill-rule="evenodd" clip-rule="evenodd" d="M8.02841 0.845924C10.4711 0.649461 12.7974 1.50981 14.5029 3.21494C16.7023 5.41533 17.4936 8.64633 16.4238 11.8192C15.3253 15.0731 12.1503 17.1737 8.71403 17.1737H8.71075C7.34115 17.1728 5.99612 16.8298 4.80099 16.1782L1.11158 17.1663C0.770002 17.2572 0.461186 16.9387 0.562759 16.6006L1.62437 13.0782C0.503781 11.1381 0.214624 8.78959 0.902702 6.54008C1.86601 3.39176 4.74447 1.10951 8.02841 0.845924ZM11.3377 12.8842C11.7129 12.8506 12.5476 12.3906 12.718 11.9134C12.8884 11.4361 12.8884 11.0268 12.8376 10.9425C12.7968 10.8741 12.7009 10.8278 12.5584 10.7592C12.5237 10.7424 12.4862 10.7243 12.446 10.7043C12.2421 10.602 11.237 10.1075 11.0494 10.0396C10.8618 9.97164 10.725 9.93726 10.589 10.1419C10.4531 10.3466 10.0615 10.8066 9.94192 10.9425C9.82233 11.0792 9.70355 11.0964 9.49876 10.9941C9.46479 10.977 9.41836 10.9568 9.36096 10.9318C9.07235 10.8063 8.50658 10.5602 7.85475 9.97983C7.24695 9.43873 6.83738 8.76994 6.71778 8.56529C6.59901 8.36146 6.7055 8.25013 6.80789 8.14863C6.86893 8.08762 6.93904 8.00234 7.00928 7.91689C7.04461 7.87392 7.07998 7.83089 7.11425 7.7909C7.20089 7.68895 7.23866 7.61202 7.29008 7.50727C7.29895 7.48922 7.30822 7.47034 7.31821 7.45036C7.3862 7.31448 7.3518 7.19496 7.30101 7.09264C7.2797 7.0497 7.19737 6.84689 7.09555 6.59607C6.95473 6.24919 6.77663 5.81047 6.67109 5.57578C6.51791 5.23606 6.35654 5.22869 6.21073 5.22296C6.09196 5.21805 5.95516 5.21805 5.81918 5.21805C5.68239 5.21805 5.46122 5.2688 5.27364 5.47345C5.2619 5.4862 5.24884 5.50009 5.23465 5.51516C5.02203 5.74113 4.55771 6.23459 4.55771 7.17695C4.55771 8.17568 5.28056 9.14046 5.39034 9.28699L5.39241 9.28975C5.4 9.2999 5.41435 9.32119 5.43528 9.35223C5.69439 9.73654 6.96155 11.616 8.88441 12.3734C10.4459 12.9885 10.8827 12.937 11.2294 12.896C11.2661 12.8917 11.3018 12.8875 11.3377 12.8842Z" fill="white"/></svg></a>';
	    idNamesPointer++;
	}


	if(config.elements["viber"]) {
	    button += '<a target="blank"  href="viber://add?number='+config.elements["viber"]+'" style="background-color: #8F46AD !important;" id="'+idNames[idNamesPointer]+'" class="shadow contact-button" role="button"><svg width="17" height="19" viewBox="0 0 17 19" fill="none" xmlns="http://www.w3.org/2000/svg"><path fill-rule="evenodd" clip-rule="evenodd" d="M16.4095 4.17713C16.1136 3.12988 15.5276 2.30263 14.6694 1.7174C13.5864 0.976689 12.3405 0.715608 11.2648 0.555733C9.77631 0.33572 8.42837 0.304919 7.14257 0.460394C5.93816 0.607069 5.03114 0.840282 4.20403 1.21724C2.58236 1.95648 1.60876 3.15188 1.31136 4.7697C1.16635 5.55588 1.0687 6.26578 1.01247 6.94342C0.882265 8.5099 1.00064 9.89598 1.3735 11.1809C1.73749 12.4335 2.37225 13.3282 3.31478 13.9163C3.55447 14.0659 3.86224 14.1745 4.15964 14.2786C4.32832 14.3373 4.49256 14.3945 4.62721 14.4576C4.75149 14.5148 4.75149 14.525 4.75001 14.6277C4.73966 15.518 4.75001 17.2635 4.75001 17.2635L4.75297 17.636H5.42768L5.53718 17.5304C5.60968 17.4629 7.28166 15.8612 7.87795 15.2159L7.95933 15.1264C8.06142 15.0091 8.06142 15.0091 8.16648 15.0076C8.9714 14.9915 9.79407 14.9607 10.6108 14.9167C11.6007 14.8639 12.7474 14.7685 13.8275 14.3226C14.8159 13.9134 15.538 13.2636 15.9715 12.3924C16.4243 11.483 16.6921 10.4988 16.7927 9.38262C16.9703 7.42011 16.8445 5.71722 16.4095 4.17713ZM12.8495 11.8086C12.6009 12.209 12.231 12.4877 11.7945 12.6681C11.4749 12.8001 11.1494 12.7723 10.8342 12.6403C8.19607 11.5329 6.12607 9.78891 4.75889 7.28077C4.54882 6.89699 4.38698 6.48728 4.22537 6.07814C4.16957 5.93686 4.11379 5.79566 4.05607 5.65561C4.02513 5.58042 4.01641 5.49589 4.00765 5.41101C4.00342 5.37006 3.99919 5.32903 3.99244 5.28893C4.01168 4.40741 4.69379 3.91018 5.3833 3.76058C5.64667 3.70191 5.88045 3.79431 6.07576 3.98059C6.61731 4.49102 7.04492 5.08505 7.36748 5.75095C7.50804 6.04284 7.44442 6.30098 7.20472 6.51806C7.15441 6.56353 7.10262 6.6046 7.04788 6.64567C6.50042 7.05342 6.42052 7.36291 6.712 7.97748C7.20916 9.02327 8.03479 9.72584 9.1016 10.1615C9.38273 10.2759 9.64759 10.2187 9.86213 9.99279L9.8749 9.98025C9.90075 9.95498 9.92722 9.92911 9.94499 9.89891C10.3652 9.20368 10.9763 9.27261 11.54 9.66864C11.7634 9.82629 11.983 9.9893 12.2024 10.1522L12.2025 10.1522L12.2026 10.1523L12.2027 10.1524L12.2028 10.1525C12.3466 10.2592 12.4903 10.3659 12.635 10.4709C13.1928 10.8772 13.1883 11.2586 12.8495 11.8086ZM8.97879 4.90024C9.1016 4.8797 9.22589 4.86944 9.35018 4.86944C10.5724 4.86944 11.5681 5.85656 11.5681 7.06809C11.5681 7.19277 11.5578 7.31597 11.5371 7.43625C11.503 7.64012 11.6421 7.83373 11.8478 7.86747C11.87 7.87187 11.8907 7.87334 11.9114 7.87334C12.0934 7.87334 12.2532 7.7428 12.2843 7.55945C12.3124 7.39958 12.3257 7.23383 12.3257 7.06809C12.3257 5.44147 10.9911 4.11846 9.35018 4.11846C9.18446 4.11846 9.01726 4.13166 8.85451 4.15953C8.64736 4.19327 8.50827 4.38688 8.5423 4.59076C8.57781 4.7961 8.77165 4.93397 8.97879 4.90024ZM11.1894 7.12236C11.1894 7.32917 11.0192 7.49785 10.8106 7.49785C10.6019 7.49785 10.4318 7.32917 10.4318 7.12236C10.4318 6.50193 9.92132 5.9959 9.29543 5.9959C9.08681 5.9959 8.91665 5.82722 8.91665 5.62041C8.91665 5.4136 9.08681 5.24493 9.29543 5.24493C10.3401 5.24493 11.1894 6.08684 11.1894 7.12236ZM12.9827 8.24882C13.1558 8.24882 13.3126 8.13148 13.3526 7.95694C13.4192 7.66213 13.4532 7.35851 13.4532 7.05342C13.4532 4.8137 11.6155 2.992 9.3561 2.992C9.04834 2.992 8.74205 3.02574 8.44613 3.09321C8.24194 3.13868 8.11321 3.33962 8.16056 3.54203C8.20643 3.74444 8.40914 3.87205 8.61333 3.82511C8.85451 3.77084 9.10456 3.74298 9.3561 3.74298C11.1968 3.74298 12.6956 5.22879 12.6956 7.05342C12.6956 7.30277 12.6675 7.55065 12.6128 7.78973C12.5669 7.99214 12.6941 8.19309 12.8983 8.24002C12.9264 8.24589 12.9546 8.24882 12.9827 8.24882Z" fill="white"/></svg></a>';
	    idNamesPointer++;
	}


	if(config.elements["od"]) {
	    button += '<a target="blank"  href="'+config.elements["od"]+'" style="background-color: #ee8208 !important;" id="'+idNames[idNamesPointer]+'" class="shadow contact-button" role="button"><svg aria-hidden="true" focusable="false" data-prefix="fab" data-icon="odnoklassniki" class="svg-inline--fa fa-odnoklassniki fa-w-10" role="img" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 320 512"><path fill="currentColor" d="M275.1 334c-27.4 17.4-65.1 24.3-90 26.9l20.9 20.6 76.3 76.3c27.9 28.6-17.5 73.3-45.7 45.7-19.1-19.4-47.1-47.4-76.3-76.6L84 503.4c-28.2 27.5-73.6-17.6-45.4-45.7 19.4-19.4 47.1-47.4 76.3-76.3l20.6-20.6c-24.6-2.6-62.9-9.1-90.6-26.9-32.6-21-46.9-33.3-34.3-59 7.4-14.6 27.7-26.9 54.6-5.7 0 0 36.3 28.9 94.9 28.9s94.9-28.9 94.9-28.9c26.9-21.1 47.1-8.9 54.6 5.7 12.4 25.7-1.9 38-34.5 59.1zM30.3 129.7C30.3 58 88.6 0 160 0s129.7 58 129.7 129.7c0 71.4-58.3 129.4-129.7 129.4s-129.7-58-129.7-129.4zm66 0c0 35.1 28.6 63.7 63.7 63.7s63.7-28.6 63.7-63.7c0-35.4-28.6-64-63.7-64s-63.7 28.6-63.7 64z"></path></svg></a>';
	    idNamesPointer++;
	}

	if(config.elements["facebook"]) {
	    button += '<a target="blank"  href="'+config.elements["facebook"]+'" style="background-color: #3b5998 !important;" id="'+idNames[idNamesPointer]+'" class="shadow contact-button" role="button"><svg aria-hidden="true" focusable="false" data-prefix="fab" data-icon="facebook-f" class="svg-inline--fa fa-facebook-f fa-w-10" role="img" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 320 512"><path fill="currentColor" d="M279.14 288l14.22-92.66h-88.91v-60.13c0-25.35 12.42-50.06 52.24-50.06h40.42V6.26S260.43 0 225.36 0c-73.22 0-121.08 44.38-121.08 124.72v70.62H22.89V288h81.39v224h100.17V288z"></path></svg></a>';
	    idNamesPointer++;
	}

	if(config.elements["instagram"]) {
	    button += '<a target="blank"  href="'+config.elements["instagram"]+'" style="background: radial-gradient(circle at 30% 107%, #FDF497 0%, #FDF497 5%, #FD5949 45%, #D6249F 60%, #285AEB 90%) !important;" id="'+idNames[idNamesPointer]+'" class="shadow contact-button" role="button"><svg aria-hidden="true" focusable="false" data-prefix="fab" data-icon="instagram" class="svg-inline--fa fa-instagram fa-w-14" role="img" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 448 512"><path fill="currentColor" d="M224.1 141c-63.6 0-114.9 51.3-114.9 114.9s51.3 114.9 114.9 114.9S339 319.5 339 255.9 287.7 141 224.1 141zm0 189.6c-41.1 0-74.7-33.5-74.7-74.7s33.5-74.7 74.7-74.7 74.7 33.5 74.7 74.7-33.6 74.7-74.7 74.7zm146.4-194.3c0 14.9-12 26.8-26.8 26.8-14.9 0-26.8-12-26.8-26.8s12-26.8 26.8-26.8 26.8 12 26.8 26.8zm76.1 27.2c-1.7-35.9-9.9-67.7-36.2-93.9-26.2-26.2-58-34.4-93.9-36.2-37-2.1-147.9-2.1-184.9 0-35.8 1.7-67.6 9.9-93.9 36.1s-34.4 58-36.2 93.9c-2.1 37-2.1 147.9 0 184.9 1.7 35.9 9.9 67.7 36.2 93.9s58 34.4 93.9 36.2c37 2.1 147.9 2.1 184.9 0 35.9-1.7 67.7-9.9 93.9-36.2 26.2-26.2 34.4-58 36.2-93.9 2.1-37 2.1-147.8 0-184.8zM398.8 388c-7.8 19.6-22.9 34.7-42.6 42.6-29.5 11.7-99.5 9-132.1 9s-102.7 2.6-132.1-9c-19.6-7.8-34.7-22.9-42.6-42.6-11.7-29.5-9-99.5-9-132.1s-2.6-102.7 9-132.1c7.8-19.6 22.9-34.7 42.6-42.6 29.5-11.7 99.5-9 132.1-9s102.7-2.6 132.1 9c19.6 7.8 34.7 22.9 42.6 42.6 11.7 29.5 9 99.5 9 132.1s2.7 102.7-9 132.1z"></path></svg></a>';
	    idNamesPointer++;
	}

	if(config.elements["vk"]) {
	    button += '<a target="blank"  href="'+config.elements["vk"]+'" style="background-color: #5d84ae !important;" id="'+idNames[idNamesPointer]+'" class="shadow contact-button" role="button"><svg aria-hidden="true" focusable="false" data-prefix="fab" data-icon="vk" class="svg-inline--fa fa-vk fa-w-18" role="img" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 576 512"><path fill="currentColor" d="M545 117.7c3.7-12.5 0-21.7-17.8-21.7h-58.9c-15 0-21.9 7.9-25.6 16.7 0 0-30 73.1-72.4 120.5-13.7 13.7-20 18.1-27.5 18.1-3.7 0-9.4-4.4-9.4-16.9V117.7c0-15-4.2-21.7-16.6-21.7h-92.6c-9.4 0-15 7-15 13.5 0 14.2 21.2 17.5 23.4 57.5v86.8c0 19-3.4 22.5-10.9 22.5-20 0-68.6-73.4-97.4-157.4-5.8-16.3-11.5-22.9-26.6-22.9H38.8c-16.8 0-20.2 7.9-20.2 16.7 0 15.6 20 93.1 93.1 195.5C160.4 378.1 229 416 291.4 416c37.5 0 42.1-8.4 42.1-22.9 0-66.8-3.4-73.1 15.4-73.1 8.7 0 23.7 4.4 58.7 38.1 40 40 46.6 57.9 69 57.9h58.9c16.8 0 25.3-8.4 20.4-25-11.2-34.9-86.9-106.7-90.3-111.5-8.7-11.2-6.2-16.2 0-26.2.1-.1 72-101.3 79.4-135.6z"></path></svg></a>';
	    idNamesPointer++;
	}


	if(config.elements["native"]) {
	    button +='<a target="blank" onclick="window.nativeShare()"  href="'+config.elements["native"]+'" style="background-color: #3b5998;" id="'+idNames[idNamesPointer]+'" class="shadow contact-button" role="button"><svg aria-hidden="true" focusable="false" data-prefix="fas" data-icon="share" class="svg-inline--fa fa-share fa-w-16" role="img" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path fill="currentColor" d="M503.691 189.836L327.687 37.851C312.281 24.546 288 35.347 288 56.015v80.053C127.371 137.907 0 170.1 0 322.326c0 61.441 39.581 122.309 83.333 154.132 13.653 9.931 33.111-2.533 28.077-18.631C66.066 312.814 132.917 274.316 288 272.085V360c0 20.7 24.3 31.453 39.687 18.164l176.004-152c11.071-9.562 11.086-26.753 0-36.328z"></path></svg></a>';
	    idNamesPointer++;
	}


	
	
	button += '</div>'
	$(button).appendTo("body");
	$(".main-button").mouseover(function(){
		$("#shadow-element").css("box-shadow", "2px 2px 6px rgba(0,0,0,0.7)");
	});
	$(".main-button").mouseleave(function(){
		$("#shadow-element").css("box-shadow", "2px 2px 6px rgba(0,0,0,0.4)");
	});
}

function toggleUp(element) {
	$(".contact-button").toggleClass("up");
	$(".menu-button").toggleClass("contact-button-out");
}


window.nativeShare = () => {
    const shareLink = location.href;

    if (navigator.share) {
        // this will work on Android
        navigator
            .share({
                title: document.title,
                url: shareLink
            })
            .then(() => console.log("Successful share"))
            .catch(error => console.log("Error sharing", error));
    } else {
        alert(`native share ${shareLink}`);   
    }
};
